target/test-classes/requests/BMP_Create_ticket.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> 
    <soap:Header/> 
    <soap:Body> 
        <ns1:createCircuitTicketRequest xmlns:ns1="http://amws.att.com/websvcs"> 
            <ns1:credentials> 
                <ns1:restrictedUser>N</ns1:restrictedUser> 
                <ns1:userName>sk737f</ns1:userName> 
            </ns1:credentials> 
            <ns1:crtCircuitTktInput> 
                <ns1:serviceId>  DHEC123456100ATI </ns1:serviceId> 
                <ns1:createLoginId>mm553x</ns1:createLoginId> 
                <ns1:originatedWkCtr>IINDCTRY</ns1:originatedWkCtr> 
                <ns1:initiatorContact> 
                    <ns1:firstName>Priya</ns1:firstName> 
                    <ns1:lastName>J</ns1:lastName> 
                    <ns1:phone>1234567890</ns1:phone> 
                    <ns1:contactNote/> 
                </ns1:initiatorContact> 
                <ns1:ticketSource>BMP</ns1:ticketSource> 
                <ns1:ticketTypeCode>CR</ns1:ticketTypeCode> 
                <ns1:troubleCode>ERR</ns1:troubleCode> 
                <ns1:troubleDescription>Errors</ns1:troubleDescription> 
                <ns1:routeToWkCtr>J111M000</ns1:routeToWkCtr> 
                <ns1:companyName>BLUE CROSS AND BLUE SHIEL</ns1:companyName> 
                <ns1:typeOfService>ISDB</ns1:typeOfService> 
                <ns1:serviceIdType>AT;T Service ID</ns1:serviceIdType> 
                <ns1:workCenterType>S</ns1:workCenterType> 
                <ns1:initiatorSchedule> 
                    <ns1:accessStartTime>2015-11-20T08:00:00.005-06:00</ns1:accessStartTime> 
                    <ns1:accessEndTime>2015-11-20T17:00:00.005-06:00</ns1:accessEndTime> 
                    <ns1:accessNote/> 
                </ns1:initiatorSchedule> 
                <ns1:custPreferNotification>EMAIL</ns1:custPreferNotification> 
                <ns1:initialCreateDate>2015-11-20T07:00:36.005-06:00</ns1:initialCreateDate> 
                <ns1:custProgressContact> 
                    <ns1:firstName>Priya</ns1:firstName> 
                    <ns1:lastName>J</ns1:lastName> 
                    <ns1:phone>1234567890</ns1:phone> 
                    <ns1:contactNote/> 
                </ns1:custProgressContact> 
                <ns1:progInterval>120</ns1:progInterval> 
                <ns1:priority>1</ns1:priority> 
                <ns1:ticketCategoryCode>1</ns1:ticketCategoryCode> 
                <ns1:autoProgIndicator>true</ns1:autoProgIndicator> 
                <ns1:autoProgRemainCnt>9</ns1:autoProgRemainCnt> 
                <ns1:dispatchAuthorization>true</ns1:dispatchAuthorization> 
                <ns1:customerAttitude>3</ns1:customerAttitude> 
                <ns1:NSEPIndicator>false</ns1:NSEPIndicator> 
                <ns1:nextCheckDate>2015-11-21T08:55:36.005-06:00</ns1:nextCheckDate> 
                <ns1:powerToCPE>Y</ns1:powerToCPE> 
                <ns1:custRptdRecurring>false</ns1:custRptdRecurring> 
                <ns1:unresolvedIndicator>false</ns1:unresolvedIndicator> 
                <ns1:escInterval>0</ns1:escInterval> 
                <ns1:reportedServiceId>123456</ns1:reportedServiceId> 
                <ns1:startCustProgMtoF>2015-11-20T08:00:00.005-06:00</ns1:startCustProgMtoF> 
                <ns1:endCustProgMtoF>2015-11-20T17:00:00.005-06:00</ns1:endCustProgMtoF> 
                <ns1:startCustProgStoS>2015-11-20T08:00:00.005-06:00</ns1:startCustProgStoS> 
                <ns1:endCustProgStoS>2015-11-20T17:00:00.005-06:00</ns1:endCustProgStoS> 
                <ns1:noSpecificContact>false</ns1:noSpecificContact> 
                <ns1:sendAutoEmail>false</ns1:sendAutoEmail> 
                <ns1:serviceClassification>S</ns1:serviceClassification> 
                <ns1:createDate>2015-11-20T08:55:36.005-06:00</ns1:createDate> 
                <ns1:SAQualifyIndicator>true</ns1:SAQualifyIndicator> 
                <ns1:routingStepUsed>20</ns1:routingStepUsed> 
                <ns1:overRideRouteToWkCtr>N</ns1:overRideRouteToWkCtr> 
                <ns1:validateContactInfo>false</ns1:validateContactInfo> 
                <ns1:validateDispatchAuthorized>false</ns1:validateDispatchAuthorized> 
                <ns1:validatePowerToCPE>false</ns1:validatePowerToCPE> 
                <ns1:originalAssignedToWorkcenter>J111M000</ns1:originalAssignedToWorkcenter> 
                <ns1:validateDispatchAuthorized>false</ns1:validateDispatchAuthorized> 
                <ns1:testIntrAuthInd>false</ns1:testIntrAuthInd> 
                <ns1:allLegDownIndicator>true</ns1:allLegDownIndicator> 
                <ns1:rptCKLDataList> 
                    <ns1:rptCKLData> 
                        <ns1:CKL>0001</ns1:CKL> 
                        <ns1:country>USA</ns1:country> 
                        <ns1:CPEType/> 
                        <ns1:CPEVendor/> 
                        <ns1:dialBackupIndicator>false</ns1:dialBackupIndicator> 
                        <ns1:valLCONInfo>false</ns1:valLCONInfo> 
                        <ns1:lContact> 
                            <ns1:name>monalisa dube</ns1:name> 
                            <ns1:telNo>7890880900</ns1:telNo> 
                            <ns1:address>Manyata Embassy Park</ns1:address> 
                            <ns1:floor>4</ns1:floor> 
                            <ns1:room>434</ns1:room> 
                            <ns1:localCompanyName>BLUE CROSS AND BLUE SHIEL</ns1:localCompanyName> 
                            <ns1:cityState>Bangalore</ns1:cityState> 
                            <ns1:zipCode>56004</ns1:zipCode> 
                            <ns1:email/> 
                        </ns1:lContact> 
                        <ns1:valLocationAccessHours>false</ns1:valLocationAccessHours> 
                        <ns1:valLCONInfo>false</ns1:valLCONInfo> 
                    </ns1:rptCKLData> 
                    <ns1:rptCKLData> 
                        <ns1:CKL>0002</ns1:CKL> 
                        <ns1:country>USA</ns1:country> 
                        <ns1:dialBackupIndicator>false</ns1:dialBackupIndicator> 
                        <ns1:valLCONInfo>false</ns1:valLCONInfo> 
                        <ns1:lContact> 
                            <ns1:name>Vaibhav</ns1:name> 
                            <ns1:telNo>61574888888</ns1:telNo> 
                            <ns1:address>Domlur</ns1:address> 
                            <ns1:floor>4</ns1:floor> 
                            <ns1:room>404</ns1:room> 
                            <ns1:localCompanyName>Mohan</ns1:localCompanyName> 
                            <ns1:cityState>Bangalore</ns1:cityState> 
                            <ns1:zipCode>45</ns1:zipCode> 
                            <ns1:email/> 
                        </ns1:lContact> 
                        <ns1:valLCONInfo>false</ns1:valLCONInfo> 
                        <ns1:valLocationAccessHours>false</ns1:valLocationAccessHours> 
                    </ns1:rptCKLData> 
                </ns1:rptCKLDataList> 
                <ns1:CKLNotFoundIndicator>false</ns1:CKLNotFoundIndicator> 
                <ns1:intrusiveTestAuthType>N</ns1:intrusiveTestAuthType> 
                <ns1:billingAuthorization>N</ns1:billingAuthorization> 
                <ns1:validateTestAuthorized>false</ns1:validateTestAuthorized> 
            </ns1:crtCircuitTktInput> 
        </ns1:createCircuitTicketRequest> 
    </soap:Body> 
</soap:Envelope>
